Repository: kuna-anarbay/loomus-edu-flutter
Catalog: lib/l10n/app_*.arb
Languages: kk

# loadingWidgetTitle
source: Loading...
kk: Жүктелуде...

# toastWidgetError
source: Error
kk: Қате

# toastWidgetSuccess
source: Success!
kk: Алақай!

# videoWidgetSpeed
source: Playback speed
kk: Жылдамдық

# videoWidgetQuality
source: Quality
kk: Бейненің сапасы

# videoWidgetError
source: Error while playing video
kk: Бейнені ойнатуда қателік туындады

# signInPageButtonTitle
source: Sign in
kk: Кіру

# signInPageCreateAccount
source: Create account
kk: Аккаунт ашу

# signInPageDontHaveAccount
source: Don't have an account?
kk: Жүйеде тіркелмегенсіз бе?

# signInPageEmail
source: Email
kk: Электрондық пошта

# signInPageForgotPassword
source: Forgot password?
kk: Құпиясөзді ұмыттыңыз ба?

# signInPageSignInWithApple
source: Sign in with Apple
kk: Apple арқылы кіру

# signInPageSignInWithGoogle
source: Sign in with Google
kk: Google арқылы кіру

# signInPagePassword
source: Password
kk: Құпиясөз

# signInPageSlogan
source: Learning has become easier and more accessible than ever 🤘
kk: Оқу бұрынғыдан да оңай және қолжетімді🤘

# signInPageTitle
source: Sign in to your account
kk: Аккаунтыңызға кіріңіз

# signUpPageCreateAccount
source: Create account
kk: Аккаунт ашу

# signUpPageRequestCode
source: Request code
kk: Кодты сұрау

# signUpPageCode
source: Verification code
kk: Растау коды

# signUpPageEmail
source: Email
kk: Электрондық пошта

# signUpPageFirstName
source: First name
kk: Аты

# signUpPageLastName
source: Last name
kk: Тегі

# signUpPagePassword
source: Password
kk: Құпиясөз

# signUpPageSlogan
source: Learning has become easier and more accessible than ever 🤘
kk: Оқу бұрынғыдан да оңай және қолжетімді🤘

# signUpPageTitle
source: Create a new account
kk: Жүйеде жаңа аккаунт ашу

# signUpPageCheckSpam
source: Please check your inbox as well as spam
kk: Email поштаңызды және спамды тексеріңіз

# resetPasswordPageReset
source: Reset
kk: Қалпына келтіру

# resetPasswordPageRequestCode
source: Request code
kk: Кодты сұрау

# resetPasswordPageCode
source: Verification code
kk: Растау коды

# resetPasswordPageEmail
source: Email
kk: Email адрес

# resetPasswordPagePassword
source: New password
kk: Жаңа құпиясөз

# resetPasswordPageSlogan
source: Learning has become easier and more accessible than ever 🤘
kk: Оқу бұрынғыдан да оңай және қолжетімді 🤘

# resetPasswordPageTitle
source: Reset password
kk: Құпиясөзді қалпына келтіріңіз

# homePageTitle
source: My courses
kk: Менің курстарым

# homePagePassed
source: %@% finished
kk: %@% аяқталды

# homePageAccessExpired
source: Your access has expired
kk: Қол жеткізу мерзімі аяқталды

# coursePageContinueLearning
source: Continue learning
kk: Оқуды жалғастыру

# coursePageModuleClosed
source: Pass previous topics first
kk: Алдымен алдыңғы тақырыптарды өтіңіз

# coursePageModuleIndex
source: module %@
kk: модуль %@

# coursePageModulePassed
source: Passed %@ from %@
kk: %@ / %@ өтілді

# coursePageLessonIndex
source: Lesson %@.
kk: Сабақ %@.

# coursePageLessonReadTime
source: %@ minutes to learn
kk: Үйрену %@ минут алады

# coursePageLessonNotActive
source: Lesson will be available later
kk: Сабақ кейінірек қолжетімді болады

# demoPageClosesAt
source: %@ before closing access
kk: %@ кейін қолжетімсіз болады

# demoPageViewProgram
source: Go to view
kk: Қарауға өту

# demoPageFullProgram
source: Full course program
kk: Курстың толық бағдарламасы

# demoPageLessonIndex
source: Lesson %@.
kk: Сабақ %@

# demoPageLessonReadTime
source: %@ minutes to learn
kk: Үйрену %@ минут алады

# lessonPageReviewTitle
source: Was the video clear?
kk: Бейнесабақ түсінікті болды ма?

# lessonPageReviewSubtitle
source: Your feedback is important to us!
kk: Сіздің пікіріңіз біз үшін маңызды!

# lessonPageReviewPositive
source: Yes, clear!
kk: Иә, түсінікті!

# lessonPageReviewNegative
source: No, it's not clear
kk: Жоқ, түсініксіз

# lessonPageReviewedTitle
source: Your feedback on the video
kk: Бейнесабақ туралы пікіріңіз

# lessonPageReviewedSubtitle
source: Thanks for helping us get better!
kk: Бізді жақсартуға көмектескеніңіз үшін рақмет!

# lessonPageReviewEdit
source: Edit
kk: Өзгерту

# lessonPageTestTitle
source: Test
kk: Тест

# lessonPageTestSubtitle
source: Did you know that taking the test improves understanding of the topic 🤯
kk: Тест тапсыру тақырыпты түсінуді жақсартатынын білесіз бе? 🤯

# lessonPageTestPassed
source: You are one step closer to the result 💯
kk: Сіз нәтижеге бір қадам жақындадыңыз 💯

# lessonPageTestResults
source: You scored %@ from %@
kk: Сіз 10 / 10 жинадыңыз

# lessonPageTestPass
source: Pass test
kk: Тестті өту

# lessonPageTestView
source: View
kk: Қарау

# lessonPageHomeworkTitle
source: Practical assignment
kk: Практикалық тапсырма

# lessonPageHomeworkSubtitle
source: Take the final step towards completing the module ✊
kk: Модульді аяқтау үшін соңғы қадамды жасаңыз ✊

# lessonPageHomeworkPassed
source: You have successfully completed the module 🎉
kk: Сіз модульді сәтті аяқтадыңыз 🎉

# lessonPageHomeworkPass
source: Pass assignment
kk: Тапсыру

# lessonPageHomeworkView
source: View
kk: Қарау

# lessonPageHomeworkPending
source: ⏳ Your work is awaiting review
kk: ⏳ Сіздің жұмысыңыз тексеруді күтуде

# lessonPageHomeworkReviewed
source: ✅ Your work is reviewed
kk: ✅ Сіздің жұмысыңыз тексерілді

# lessonPageHomeworkSubmittedAt
source: You completed the task at %@
kk: Сіз тапсырманы %@ аяқтадыңыз

# lessonPageHomeworkSolution
source: Assignment analysis:
kk: Тапсырманың талдауы:

# lessonPageQuestionTitle
source: Ask a question
kk: Сұрақ қойыңыз

# lessonPageQuestionSubtitle
source: Submit your questions and we'll get back to you in our weekly webinar.
kk: Сұрақтарыңызды жіберіңіз, біз сізге апта сайынғы вебинарда жауап береміз

# lessonPageQuestionField
source: Question
kk: Сұрақ

# lessonPageQuestionAsk
source: Send
kk: Жіберу

# homeworkPageTitle
source: Practical assignment
kk: Практикалық тапсырма

# homeworkPageAnswer
source: Your answer
kk: Сіздің жауабыңыз

# homeworkPageComments
source: Comments
kk: Коммент

# homeworkPageAttach
source: Attach image
kk: Суретті тіркеу

# homeworkPageSubmit
source: Submit assignment
kk: Жұмысты тапсыру

# homeworkPageGallery
source: Gallery
kk: Галерея

# homeworkPageCamera
source: Camera
kk: Камера

# homeworkPageCancel
source: Cancel
kk: Жабу

# homeworkPageProTitle
source: Plan PRO
kk: Тариф PRO

# homeworkPageProDescription
source: Submit your work and get personalized feedback from curators
kk: Жұмысыңызды жіберіңіз және кураторлардан жеке жауап алыңыз

# homeworkPageProUnlock
source: Upgrade plan
kk: Тарифты жаңарту

# homeworkPageSuccess
source: Your work has been successfully submitted
kk: Сіздің жұмысыңыз сәтті жіберілді

# homeworkTermsPageTitle
source: Instructions for the assignment
kk: Тапсырмаға арналған нұсқаулық

# homeworkTermsPageDontShow
source: Don't show again
kk: Енді көрсетпеу

# homeworkTermsPageSubmit
source: Go to assignment
kk: Тапсырмаға өту

# homeworkTermsPageTerm1
source: Open the assignment file.
kk: Тапсырмасы бар файлды ашыңыз.

# homeworkTermsPageTerm2
source: Write the answers in the text field or write them on paper, then attach a photo of the answers.
kk: Жауаптарды мәтін жолағына жазыңыз немесе оларды қағазға жазыңыз, содан кейін жауаптардың суретін тіркеңіз.

# homeworkTermsPageTerm3
source: Press the "Submit assignment" button to be checked by the curator.
kk: Батырманы басыңыз"Тапсырманы тапсыру" Жетекшімен тексеру үшін.

# homeworkTermsPageTerm4
source: The curator will check the assignment within 72 hours from the date of submission and give feedback.
kk: Жетекші тапсырманы тапсырған сәттен бастап 72 сағат ішінде тексереді және кері байланыс береді.

# testPageTitle
source: Test
kk: Тест

# testPageQuestionIndex
source: question %@
kk: Сұрақ %@

# testPagePassed
source: Test successfully passed 💪
kk: Тест сәтті өтілді 💪

# testPageFailed
source: Test failed 😢
kk: Тест өтілген жоқ 😢

# testPageFailedSubtitle
source: Repeat the topic and try again
kk: Тақырыпты қайталап және қайта өтіп көріңіз

# testPageSubmit
source: Finish test
kk: Тестті аяқтау

# testPageRepeat
source: Try again
kk: Қайтадан өту

# testPageSolution
source: Explanation
kk: Түсініктеме

# testPageSubmittedAt
source: You finished test at %@
kk: Сіз тестті %@ аяқтадыңыз

# testTermsPageTitle
source: Test Instructions
kk: Тестке арналған нұсқаулық

# testTermsPageDontShow
source: Don't show again
kk: Енді көрсетпеу

# testTermsPageSubmit
source: Go to the test
kk: Тестке өту

# testTermsPageTerm1
source: Take a test on the topic covered.
kk: Өткен тақырып бойынша тест тапсырыңыз.

# testTermsPageTerm2
source: You can take the test whenever you want, as many times as you like.
kk: Сіз тестілеуді қалаған уақытта және қалағаныңызша тапсыра аласыз.

# testTermsPageTerm3
source: The main thing is to pass the test for %@%.
kk: Ең бастысы - тестті %@% тапсырыңыз.

# testTermsPageTerm4
source: Next lesson will only open when you get %@% on this test.
kk: Келесі сабақ берілген тест бойынша %@% алған кезде ғана ашылады.

# editProfilePageTitle
source: Edit profile
kk: Аккаунты өңдеу

# editProfilePageFirstName
source: First name
kk: Аты

# editProfilePageLastName
source: Last name
kk: Тегі

# editProfilePageEditAvatar
source: Edit photo
kk: Суретті өзгерту

# editProfilePageGallery
source: Gallery
kk: Галерея

# editProfilePageCamera
source: Camera
kk: Камера

# editProfilePageCancel
source: Cancel
kk: Жабу

# editProfilePageDeleteAvatar
source: Delete photo
kk: Суретті өшіру

# editProfilePageLogout
source: Logout
kk: Шығу

# editProfilePageDeleteAccount
source: Delete account
kk: Парақшаны өшіру

# editProfilePageSave
source: Save
kk: Сақтау

# editProfilePageSuccess
source: Profile updated successfully
kk: Профиль сәтті өңделді

# profilePageLanguage
source: Language
kk: Тіл

# profilePageShare
source: Share app
kk: Қосымшамен бөлісу

# profilePageRate
source: Rate app
kk: Қосымшаны бағалау

# profilePageSupport
source: Support
kk: Көмек

# profilePageVersion
source: Version %@
kk: Версия %@

# profilePageCancel
source: Cancel
kk: Жабу

# profilePageTitle
source: Profile
kk: Профиль

# profilePageEdit
source: Edit
kk: Өңдеу
